Repository: strumjan/donate-product-host
Catalog: languages/donate-product-host-*.po
Languages: hr, mk_mk

source: Donate Product Host
hr: Donirajte proizvod - domaćin
mk_mk: Донирај производ - домаќин

source: Donate Product
hr: Donirajte proizvod
mk_mk: Донирај производ

source: Add New Campaign
hr: Dodaj novu kampanju
mk_mk: Додади нова кампања

source: View Campaigns
hr: Pregledaj kampanje
mk_mk: Прегледај кампањи

source: Archived Campaigns
hr: Arhivirane kampanje
mk_mk: Архивирани кампањи

source: Settings
hr: Postavke
mk_mk: Поставки

source: About
hr: Za
mk_mk: За

source: About Donate Product Host
hr: Za Doniraj proizvod - domaćin
mk_mk: За Донирај производ - домаќин

source: The Donate Product Host plugin is designed to facilitate the management and tracking of donation campaigns for websites using WooCommerce. This plugin enables the creation and management of campaigns, with a virtual product used as the donation item.
hr: Plugin Doniraj proizvod - domaćin dizajniran je za olakšavanje upravljanja i praćenja donacijskih kampanja za web stranice koje koriste WooCommerce. Ovaj plugin omogućuje kreiranje i upravljanje kampanjama, pri čemu se virtualni proizvod koristi kao donacijska stavka.
mk_mk: Плагинот Донирај производ - домаќин е дизајниран за олеснување на управувањето и следењето на донациските кампањи за веб-страниците кои користат WooCommerce. Овој плагин овозможува креирање и управување со кампањи, каде што виртуелен производ се користи како донациска ставка.

source: Key Features:
hr: Ključne značajke:
mk_mk: Клучни карактеристики:

source: Campaign Management:
hr: Upravljanje kampanjama:
mk_mk: Управување со кампањи:

source: Administrators can create multiple donation campaigns, each associated with a specific domain and product. Each campaign can track required and donated quantities, ensuring transparent and accurate management of donations.
hr: Administratori mogu kreirati više donacijskih kampanja, svaku povezanu s određenom domenom i proizvodom. Svaka kampanja može pratiti potrebne i donirane količine, osiguravajući transparentno i precizno upravljanje donacijama.
mk_mk: Администраторите можат да креираат повеќе донациски кампањи, секоја поврзана со специфичен домен и производ. Секоја кампања може да ги следи потребните и донираните количини, осигурувајќи транспарентно и прецизно управување со донациите.

source: Client Integration:
hr: Integracija klijenata:
mk_mk: Интеграција на клиенти:

source: Each campaign generates a unique client key and corresponding JSON file that can be used by client websites to integrate with the host's donation system.
hr: Svaka kampanja generira jedinstveni klijentski ključ i odgovarajuću JSON datoteku koja može biti korištena od strane klijentskih web stranica za integraciju s donacijskim sustavom domaćina.
mk_mk: Секоја кампања генерира уникатен клиентски клуч и соодветна JSON датотека која може да се користи од страна на клиентските веб-страници за интеграција со донацискиот систем на домаќинот.

source: WooCommerce Compatibility:
hr: Kompatibilnost s WooCommerce:
mk_mk: Компатибилност со WooCommerce:

source: Seamlessly integrates with WooCommerce to create virtual products used for donations, ensuring compatibility and ease of use within the WooCommerce ecosystem.
hr: Besprijekorno se integrira s WooCommerce-om kako bi kreirao virtualne proizvode koji se koriste za donacije, osiguravajući kompatibilnost i jednostavnost korištenja unutar WooCommerce ekosustava.
mk_mk: Беспрекорно се интегрира со WooCommerce за да создаде виртуелни производи кои се користат за донации, осигурувајќи компатибилност и лесно користење во рамките на WooCommerce екосистемот.

source: Security and Validation:
hr: Sigurnost i provjera:
mk_mk: Безбедност и валидација:

source: Utilizes JWT (JSON Web Tokens) for secure generation and validation of client keys, ensuring that only authorized campaigns and clients can communicate with the system.
hr: Koristi JWT (JSON Web Tokens) za sigurno generiranje i validaciju klijentskih ključeva, osiguravajući da samo autorizirane kampanje i klijenti mogu komunicirati sa sustavom.
mk_mk: Користи JWT (JSON Web Tokens) за сигурно генерирање и валидација на клиентските клучеви, осигурувајќи дека само овластени кампањи и клиенти можат да комуницираат со системот.

source: Customizable Campaign Details:
hr: Prilagodljivi detalji kampanje:
mk_mk: Прилагодливи детали за кампањата:

source: Administrators can specify the campaign name, client domain, client email, product ID, and required quantity for each campaign. The plugin also supports updating and managing quantities and total donation amounts.
hr: Administratori mogu specificirati naziv kampanje, klijentsku domenu, email klijenta, ID proizvoda i potrebnu količinu za svaku kampanju. Plugin također podržava ažuriranje i upravljanje količinama i ukupnim iznosima donacija.
mk_mk: Администраторите можат да го специфицираат името на кампањата, доменот на клиентот, е-поштата на клиентот, ID-то на производот и потребната количина за секоја кампања. Плагинот исто така поддржува ажурирање и управување со количините и вкупните износи на донациите.

source: User-Friendly Interface:
hr: Korisnički-prijateljsko Sučelje:
mk_mk: Корисничко-пријателски интерфејс:

source: Provides an intuitive and easy-to-use interface for creating and managing campaigns, with detailed tables displaying all relevant information for each campaign.
hr: Pruža intuitivno i jednostavno sučelje za kreiranje i upravljanje kampanjama, s detaljnim tablicama koje prikazuju sve relevantne informacije o svakoj kampanji.
mk_mk: Обезбедува интуитивен и лесен интерфејс за креирање и управување со кампањи, со детални табели кои ги прикажуваат сите релевантни информации за секоја кампања.

source: By leveraging these features, the Donate Product Host plugin provides a robust solution for managing donation campaigns, ensuring that administrators have the tools they need to effectively track and manage their donation products within WooCommerce.
hr: Korištenjem ovih značajki, plugin Doniraj proizvod - domaćin pruža robusno rješenje za upravljanje donacijskim kampanjama, osiguravajući da administratori imaju alate koji su im potrebni za učinkovito praćenje i upravljanje svojim donacijskim proizvodima unutar WooCommerce-a.
mk_mk: Користејќи ги овие карактеристики, плагинот Donate Product Host обезбедува робусно решение за управување со донациските кампањи, осигурувајќи дека администраторите ги имаат потребните алати за ефикасно следење и управување со своите донациски производи во рамките на WooCommerce.

source: Main Settings
hr: Glavne postavke
mk_mk: Главни поставки

source: Secret Key
hr: Tajni ključ
mk_mk: Таен клуч

source: Host email
hr: Email domaćina
mk_mk: Е-пошта на домаќинот

source: Donate at self
hr: Doniraj i na svoju stranicu
mk_mk: Донација на вашата страница

source: Product ID to donate at self
hr: ID proizvoda koji će se donirati na vašoj web stranici
mk_mk: ИД на производот кој ќе се донира на вашата страница

source: Configure the main settings for the Donate Product Host plugin.
hr: Konfigurirajte glavne postavke plugin-a Doniraj proizvod - domaćin.
mk_mk: Конфигурирајте ги главните поставки на плагинот Донирај производ - домаќин.

source: Set a secret key to ensure the security of sharing data with customers.
hr: Postavite tajni ključ kako biste osigurali sigurnost dijeljenja podataka s klijentima.
mk_mk: Поставете таен клуч кој ќе ја гарантира безбедноста на споделувањето податоци со клиентите.

source: Never share this secret key with customers!
hr: Nikada ne dijelite ovaj tajni ključ s klijentima!
mk_mk: Овој таен клуч никако не го споделувајте со клиентите!

source: Set up an email address where you want to receive donation notifications.
hr: Postavite e-poštu na koju želite primati obavijesti o donacijama.
mk_mk: Поставете е-пошта каде сакате да ги добивате известувањата за донациите.

source: Check if you want to include a donation product on your website as well.
hr: Označite želite li na svoju web stranicu uključiti i proizvod donacije.
mk_mk: Чекирајте ако сакате да вклучите производ за донирање и на вашата веб страница.

source: Campaign with this name already exists for this client domain!
hr: Kampanja s tim imenom već postoji za tu klijentsku domenu!
mk_mk: Кампања со тоа име веќе постои за тој клиентски домеин!

source: Client and campaign added successfully!
hr: Klijent i kampanja su uspješno dodani!
mk_mk: Клиентот и кампањата се успешно додадени!

source: Invalid Product ID!
hr: Nevalidni ID proizvoda!
mk_mk: Невалиден ИД на производ!

source: Campaign Name
hr: Naslov kampanje
mk_mk: Име на кампања

source: Set a campaign title to display on the donor page instead of your actual product name. The title is associated with the customer's domain and cannot be used multiple times for the same domain. But the same title can be used for different domains.
hr: Postavite naslov kampanje koji će se prikazivati ​​na donatorskoj stranici umjesto stvarnog naziva vašeg proizvoda. Naslov je povezan s klijentovom domenom i ne može se koristiti više puta za istu domenu. Ali isti naslov se može koristiti za različite domene.
mk_mk: Поставете наслов за кампања кој ќе се прикажува на донаторската страница наместо вистинското име на вашиот производ. Насловот се поврзува со доменот на клиентот и не може повеќе пати да се користи за истиот домен. Но може да се користи истиот наслов за различни домени.

source: For example, you donate a product "low-stemmed plant" and the title of the campaign can be "Landscaping for a kindergarten". Or you donate a "Juicer" product and the title of the campaign can be "Equipping a kitchen for a school".
hr: Na primjer, donirate proizvod „niska stabljika“, a naslov kampanje može biti „Uređenje okoliša za dječji vrtić“. Ili donirate proizvod "Sokovnik", a naziv akcije može biti "Opremimo kuhinju za školu".
mk_mk: На пример донирате производ „нискостеблесто растение“ а насловот на кампањата може да биде „Уредување двор за детска градинка“. Или донирате производ „Соковник“ а насловот на кампањата може да биде „Опремување кујна за училиште“.

source: Client Domain
hr: Klijentska domena
mk_mk: Клиентски домен

source: Enter the domain of the donor site that should show the donation product to its site. Set it to example.com format.
hr: Unesite domenu donatorske stranice koja bi trebala preuzeti proizvod donacije na svoju stranicu. Postavite ga u formatu example.com .
mk_mk: Внесете го доменот на донаторската страница која треба да го преземе производот за донација на нејзината страница. Поставете го во формат example.com .

source: Client Email
hr: Email klijenta
mk_mk: Клиентска е-пошта

source: Set up a customer email to contact for the relevant campaign.
hr: Postavite e-poštu klijenta za kontakt za relevantnu kampanju.
mk_mk: Поставете е-пошта од клиентот на која ќе контактирате за соодветната кампања.

source: Product ID
hr: ID proizvoda
mk_mk: ИД на производ

source: Enter the ID of the product you intend to donate through this campaign.
hr: Unesite ID proizvoda koji namjeravate donirati kroz ovu kampanju.
mk_mk: Впишете го ИД-то на производот кој сте го предвиделе за донирање преку оваа кампања.

source: Required Quantity
hr: Potrebna količina
mk_mk: Потребна количина

source: Enter the amount of donated products after which the campaign will end.
hr: Unesite iznos doniranih proizvoda nakon kojeg će kampanja završiti.
mk_mk: Впишете количина на донирани производи после која ќе заврши кампањата.

source: Add Campaign
hr: Dodaj kampanju
mk_mk: Додади кампања

source: Settings saved successfully!
hr: Postavke su uspješno sačuvane!
mk_mk: Поставките се успешно зачувани!

source: Settings not saved.
hr: Postavke nisu sačuvane.
mk_mk: Поставките не се зачувани.

source: Product Price
hr: Cijena proizvoda
mk_mk: Цена на производот

source: Required Qty.
hr: Potrebna kol.
mk_mk: Потребна кол.

source: Donated Qty.
hr: Donirana kol.
mk_mk: Донирана кол.

source: Total Amount
hr: Ukupna vrijednost
mk_mk: Вкупна сума

source: Start Date
hr: Dautm početka
mk_mk: Почетен датум

source: Client key
hr: Klijentski ključ
mk_mk: Клиентски клуч

source: Actions
hr: Akcije
mk_mk: Акции

source: Copy
hr: Kopiraj
mk_mk: Копирај

source: Send
hr: Pošalji
mk_mk: Прати

source: Archive
hr: Arhiviraj

source: No campaigns found.
hr: Nema pronađenih kampanja.
mk_mk: Нема пронајдено кампањи.

source: Message from
hr: Poruka od
mk_mk: Порака од

source: This is your Client key:
hr: Ovo je vaš klijentski ključ:
mk_mk: Ова е вашиот клиентски клуч:

source: Email sent successfully
hr: Poruka je uspješno poslana
mk_mk: Пораката е успешно пратена

source: Failed to send email
hr: Nije uspjelo slanje poruke
mk_mk: Не успеа праќањето на пораката

source: Unarchive
hr: Odarhiviraj

source: No archived campaigns found.
hr: Nema pronađenih arhiviranih kampanja.
mk_mk: Нема пронајдено архивирани кампањи.

source: Are you sure you want to archive this campaign?
hr: Sigurno li želite arhivirati kampanju?

source: Campaign archived successfully.
hr: Kampanja je uspješno arhivirana.

source: Failed to archive the campaign.
hr: Neuspješno arhiviranje.

source: Are you sure you want to unarchive this campaign?
hr: Sigurno li želite odarhivirati kampanju?

source: Campaign unarchived successfully.
hr: Kampanja je uspješno odarhivirana.

source: Failed to unarchive the campaign.
hr: Neuspješno odarhiviranje.
